In [1]:
!pip install  pandas

Requirement already satisfied: pandas in c:\users\user\anaconda3\lib\site-packages (1.4.2)
Requirement already satisfied: numpy>=1.18.5 in c:\users\user\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\user\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [2]:
import pandas as pd

In [3]:
pd

In [4]:
hipandas=pd.Series([1,2,3,4,5])
print(hipandas)
print(hipandas.values)
print(hipandas.index)

0    1
1    2
2    3
3    4
4    5
dtype: int64
[1 2 3 4 5]
RangeIndex(start=0, stop=5, step=1)

In [5]:
hipandas1=pd.Series([2,3,4,5,6])
print(hipandas1)
print(hipandas1.values)
print(hipandas1.index)

0    2
1    3
2    4
3    5
4    6
dtype: int64
[2 3 4 5 6]
RangeIndex(start=0, stop=5, step=1)

In [26]:
dict1={'taipei':'台北','taichung':'台中','kaohsiung':'高雄'}
city=pd.Series(dict1)

In [27]:
print(city['taipei':'taichung'])

taipei      台北
taichung    台中
dtype: object

In [20]:
hipandas[1]

2

In [21]:
hipandas[2]

3

In [22]:
se1=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

In [24]:
se1['a']

1

In [25]:
se1['b']

2

In [28]:
df=pd.DataFrame([[64,200,32],
                [90,234,453],
                [74,33,22],
                [67,33,77]])
df

    0    1    2
0  64  200   32
1  90  234  453
2  74   33   22
3  67   33   77

In [42]:
df2=pd.DataFrame([[64,200,32],
                [90,234,453],
                [74,33,22],
                [67,33,77]],
                index=['小王','小莉','小陳','小張'])

df2

     0    1    2
小王  64  200   32
小莉  90  234  453
小陳  74   33   22
小張  67   33   77

In [44]:
scores={'國文':{'王小明':65,'李小美':90,'陳大同':81,'林小玉':79},
        '英文':{'王小明':92,'李小美':72,'陳大同':66,'林小玉':53},
        '數學':{'王小明':80,'李小美':44,'陳大同':85,'林小玉':68},
        '自然':{'王小明':90,'李小美':72,'陳大同':34,'林小玉':98},
        '社會':{'王小明':92,'李小美':56,'陳大同':86,'林小玉':33}}
df3=pd.DataFrame(scores)
df3

     國文  英文  數學  自然  社會
王小明  65  92  80  90  92
李小美  90  72  44  72  56
陳大同  81  66  85  34  86
林小玉  79  53  68  98  33

In [45]:
se1 = pd.Series({'王小明':65,'李小美':90,'陳大同':81,'林小玉':79})
se2 = pd.Series({'王小明':92,'李小美':72,'陳大同':85,'林小玉':53})
se3 = pd.Series({'王小明':78,'李小美':76,'陳大同':91,'林小玉':47})
se4 = pd.Series({'王小明':83,'李小美':93,'陳大同':89,'林小玉':94})
se5 = pd.Series({'王小明':70,'李小美':56,'陳大同':94,'林小玉':80})
df3 = pd.DataFrame({ '國文':se1,'英文':se2,'數學':se3,
                   '自然':se4,'社會':se5} )
df3

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [46]:
se1 = pd.Series({'王小明':65,'李小美':90,'陳大同':81,'林小玉':79})
se2 = pd.Series({'王小明':92,'李小美':72,'陳大同':85,'林小玉':53})
se3 = pd.Series({'王小明':78,'李小美':76,'陳大同':91,'林小玉':47})
se4 = pd.Series({'王小明':83,'李小美':93,'陳大同':89,'林小玉':94})
se5 = pd.Series({'王小明':70,'李小美':56,'陳大同':94,'林小玉':80})
df4 = pd.concat([se1,se2,se3,se4,se5], axis=1)
df4.columns=['國文','英文','數學','自然','社會']
df4

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [47]:
df4["自然"]

王小明    83
李小美    93
陳大同    89
林小玉    94
Name: 自然, dtype: int64

In [49]:
df4[["自然","英文"]]

     自然  英文
王小明  83  92
李小美  93  72
陳大同  89  85
林小玉  94  53

In [50]:
df4[df4["數學"]>=70]

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94

In [53]:
df4[df4["英文"]<=80]

     國文  英文  數學  自然  社會
李小美  90  72  76  93  56
林小玉  79  53  47  94  80

In [54]:
df4.values

array([[65, 92, 78, 83, 70],
       [90, 72, 76, 93, 56],
       [81, 85, 91, 89, 94],
       [79, 53, 47, 94, 80]], dtype=int64)

In [58]:
df4.loc[["王小明","李小美"],["數學","自然"]]

     數學  自然
王小明  78  83
李小美  76  93

In [59]:
df4.loc["王小明":,"英文":"數學"]

     英文  數學
王小明  92  78
李小美  72  76
陳大同  85  91
林小玉  53  47

In [60]:
df4.loc["林小玉",:]

國文    79
英文    53
數學    47
自然    94
社會    80
Name: 林小玉, dtype: int64